{
  "common": {
    "name": "ocpp",
    "version": "0.12.1",
    "news": {
      "0.12.1": {
        "en": "we now also detect feature profiles if clients add unallowed whitespaces",
        "de": "wir erkennen nun auch feature-profile, wenn clients unallowed whitespaces hinzufügen",
        "ru": "мы теперь также обнаруживаем профили функции, если клиенты добавляют неразрешенные белые пространства",
        "pt": "agora também detectamos perfis de recursos se os clientes adicionarem espaços brancos não permitidos",
        "nl": "we detecteren nu ook kenmerken als cliënten onopgeloste witspaces toevoegen",
        "fr": "nous détectons maintenant des profils de fonctionnalités si les clients ajoutent des espaces blancs non autorisés",
        "it": "ora anche rilevare profili di funzionalità se i client aggiungono spazi bianchi non consentiti",
        "es": "ahora también detectamos perfiles de características si los clientes añaden espacios blancos no permitidos",
        "pl": "obecnie wykrywamy również profile, jeśli klienci dodają nieprzyzwyczajne białej przestrzeni",
        "uk": "ми тепер також визначаємо профілі функцій, якщо клієнти додають неперевершені білі простори",
        "zh-cn": "现在,如果客户增加白空间,我们也发现各种特点。"
      },
      "0.12.0": {
        "en": "the `idTag` for remote transactions is now `ioBroker` persistent over all transactions\nimplemented the management of authentication list\nonly create states if supported by profile (closes #22)\nincreased stability on first connection",
        "de": "der idTag für Remote-Transaktionen ist jetzt ioBroker persistent über alle Transaktionen\ndie verwaltung der authentifizierungsliste implementiert\nnur zustände erstellen, wenn von profil unterstützt (schließt #22)\nerhöhte stabilität beim ersten anschluss",
        "ru": "idTag для удаленных транзакций теперь ioBroker настойчиво по всем операциям\nреализовано управление списком аутентификации\nтолько создавать государства, если поддерживается профилем (closes #22)\nповышенная стабильность при первом подключении",
        "pt": "o idTag para transações remotas é agora ioBroker persistente sobre todas as transações\nimplementou a gestão da lista de autenticação\nsomente criar estados se suportado pelo perfil (fecha #22)\naumento da estabilidade na primeira conexão",
        "nl": "de idTag voor afgelegen transacties is nu ioBroker volhardend over alle transacties\nde management van de authenticatielijst\ncreëer alleen staten als ondersteund door profiel (closes #22)\nverhoogde stabiliteit op het eerste verband",
        "fr": "idTag pour les transactions à distance est maintenant ioBroker persistant sur toutes les transactions\nmis en œuvre la gestion de la liste d'authentification\ncréer des états uniquement si le profil est supporté (ferme #22)\nune stabilité accrue à la première connexion",
        "it": "il idTag per le transazioni remote è ora ioBroker persistente su tutte le transazioni\nimplementato la gestione dell'elenco di autenticazione\nsolo creare stati se supportati dal profilo (chiude #22)\nmaggiore stabilità sul primo collegamento",
        "es": "idTag para transacciones remotas es ahora ioBroker persistente sobre todas las transacciones\nimplementó la gestión de la lista de autenticación\nsólo crear estados si apoyados por perfil (cerca #22)\nmayor estabilidad en la primera conexión",
        "pl": "idTag dla odległych transakcji jest obecnie ioBrokerem uproszczonym nad wszystkimi transakcjami\nzaimplementował zarządzanie listami autentyczności\nutwory mogą być wspierane przez profil (ogranicz #22)\nzwiększona stabilność pierwszego związku",
        "uk": "idTag для віддалених транзакцій тепер ioBroker стійкий до всіх транзакцій\nвпроваджено управління переліком автентифікації\nтільки створити стани, якщо підтримується профіль (закриває #22)\nпідвищена стійкість при першому підключенні",
        "zh-cn": "远距离交易的投标现在是对所有交易都保持沉默。\n执行核证清单的管理\n只有在概况(编号:第22号)支持下才能创建国家\nb. 第一个联系方面的稳定增加"
      },
      "0.11.1": {
        "en": "we now correctly detect data type and role of configuration attributes",
        "de": "wir erkennen nun den datentyp und die rolle von konfigurationsattributen korrekt",
        "ru": "мы теперь правильно обнаруживаем тип данных и роль атрибутов конфигурации",
        "pt": "agora detectamos corretamente o tipo de dados e o papel dos atributos de configuração",
        "nl": "we detecteren datatype en rol van configuatie-aanklachten",
        "fr": "nous détectons maintenant correctement le type de données et le rôle des attributs de configuration",
        "it": "ora rilevare correttamente il tipo di dati e il ruolo degli attributi di configurazione",
        "es": "detectamos correctamente el tipo de datos y el papel de los atributos de configuración",
        "pl": "obecnie wykrywamy typ danych i rolę atrybutów konfiguracyjnych",
        "uk": "ми тепер правильно виявити тип даних і роль атрибутів конфігурації",
        "zh-cn": "我们现在正确地发现数据类型和组合特征的作用"
      },
      "0.11.0": {
        "en": "`idTag` is now read correctly from `startTransaction` message (closes #21)\nimplemented possibility to trigger `hard` and `soft` reset",
        "de": "idTag wird nun korrekt von startTransaction message gelesen (schließt #21)\nimplementierte möglichkeit, harte und weiche rückstellung auszulösen",
        "ru": "idTag теперь правильно читается с сообщения startTransaction (closes #21)\nреализована возможность вызвать жесткий и мягкий сброс",
        "pt": "idTag é agora lido corretamente da mensagem startTransaction (closes #21)\npossibilidade implementada para desencadear hard e soft reset",
        "nl": "IDTag wordt nu juist gelezen van start-Transactie bericht (closes #21)\nde mogelijkheid om hard en zacht reset te activeren",
        "fr": "idTag est maintenant lu correctement à partir du message de lancementTransaction (ferme #21)\npossibilité de déclencher une réinitialisation dure et douce",
        "it": "idTag è ora letto correttamente dal messaggio startTransaction (chiude #21)\npossibilità implementata per attivare reset rigido e morbido",
        "es": "idTag ahora se lee correctamente desde el mensaje de inicioTransacción (cerca #21)\nposibilidad implementada para desencadenar el reinicio duro y suave",
        "pl": "idTag jest teraz odczytywany z wiadomości startTransaction (o blisko 21)\nzaimplementowana możliwość wywołania twardego i łagodnego resetu",
        "uk": "idTag тепер добре читається від початкуПереказ повідомлення (закриває #21)\nвпроваджено можливість викликати жорсткий і м'який скидання",
        "zh-cn": "现已正确地阅读了自开始的流通信息(第21号行动)\nb. 实施的可能性"
      },
      "0.10.0": {
        "en": "implemented state to control number of phases used for charging",
        "de": "implementierter zustand zur steuerung der anzahl der zum laden verwendeten phasen",
        "ru": "реализованное состояние для контроля количества фаз, используемых для зарядки",
        "pt": "estado implementado para controlar o número de fases usadas para carregar",
        "nl": "geïnformeerd tot controlenummer van fasen gebruikt voor het opladen van",
        "fr": "état mis en œuvre pour contrôler le nombre de phases utilisées pour le chargement",
        "it": "stato implementato per controllare il numero di fasi utilizzate per la ricarica",
        "es": "estado implementado para controlar el número de fases utilizadas para la carga",
        "pl": "wdrażany stan kontroli liczby faz używanych do ładowania ładowania",
        "uk": "впроваджений стан для контролю кількості фаз, що використовуються для зарядки",
        "zh-cn": "实施国家控制用于慈善阶段的数量"
      },
      "0.9.1": {
        "en": "we now avoid not implemented logging if `chargeLimit` is set to null (deactivated)",
        "de": "wir vermeiden jetzt nicht durchgeführte Protokollierung Limit wird auf Null gesetzt (deaktiviert)",
        "ru": "мы теперь избегаем не реализованных логов, если заряд Лимит установлен на null (деактивирован)",
        "pt": "nós evitamos agora o registro não implementado se cobrar Limite é definido para nulo (desativado)",
        "nl": "we vermijden nu geen inrichting als aanklacht Limit is klaar om te kalmeren",
        "fr": "nous évitons maintenant de ne pas implémenter l'enregistrement si la charge La limite est fixée à null (désactivée)",
        "it": "ora evitiamo di non implementato logging se la carica Il limite è impostato a null (disattivato)",
        "es": "ahora evitamos que no se implemente registro si carga El límite está fijado para anular (desactivado)",
        "pl": "teraz unikamy wdrożenia logowania, jeśli akcje są obciążone. Limit jest ustawiony w null (deaktywowany)",
        "uk": "ми зараз не втілюємо загибель, якщо заряд Ліміт встановлюється на null (деактивований)",
        "zh-cn": "我们现在避免执行伐木,如果收费的话。 限制规定无效(终止)"
      },
      "0.9.0": {
        "en": "* we removed states from main connector which are not allowed there\n* we now synchronize configuration into adapter\n* we added ack flag to `availability` state\n* we added ack flag for `charge limit` states\n* we optimized error logging\n* we now allow changing charger configuration via adapter\n* we improved reconnect handling\n\n__Please delete all states of connector 0 once__",
        "de": "* wir entfernte zustände vom hauptverbinder, die dort nicht erlaubt sind\n* wir synchronisieren jetzt konfiguration in adapter\n* wir haben ack flag zum verfügbarkeitszustand hinzugefügt\n* wir haben einck flag für `charge limit` zustände hinzugefügt\n* wir optimierte fehlerprotokollierung\n* wir erlauben nun eine änderung der ladegerätkonfiguration über adapter\n* wir verbesserte reconnect handling\n\n_Bitte löschen Sie alle Zustände des Steckverbinders 0 einmal_",
        "ru": "* мы удалили штаты от главного соединителя который не позволенный там\n* мы теперь синхронизируем конфигурацию в адаптер\n* мы добавили ack флаг в состояние доступности\n* мы добавили флаг ack для `charge limit` состояния\n* мы оптимизировали логирование ошибок\n* теперь мы позволяем изменить конфигурацию зарядного устройства через адаптер\n* мы улучшили переподключение обработки\n\n_Пожалуйста, удалите все состояния разъема 0 раз_",
        "pt": "* removemos estados do conector principal que não são permitidos lá\n* agora sincronizamos a configuração no adaptador\n* adicionamos ack flag ao estado de disponibilidade\n* nós adicionamos ack flag for `charge limit` states\n* nós otimizado registro de erro\n* agora permitimos alterar a configuração do carregador através do adaptador\n* melhoramos o manuseio de reconectação\n\nPor favor, exclua todos os estados do conector 0 uma vez_",
        "nl": "♪ we verwijderde staten van de belangrijkste connector die daar niet mogen\n♪ we now synchronize configuration into adapter ♪\n♪ we made ack vlag to availity state ♪\nquality over quantity (qoq) releases vertaling:\n♪ we optimiseerde fout logging ♪\n♪ we nu toestaan het veranderen van oplader configuration via adapter ♪\n♪ we verbeterde verbinding\n\nVerwijder alle staten van connector 0 eens",
        "fr": "* nous avons enlevé les états du connecteur principal qui ne sont pas permis là\n* nous synchronisons maintenant la configuration en adaptateur\n* nous avons ajouté ack flag à la disponibilité état\n* nous avons ajouté ack flag pour les états de charge\n* nous avons optimisé l'enregistrement des erreurs\n* nous permettons maintenant de modifier la configuration du chargeur via adaptateur\n* nous avons amélioré la manipulation de reconnect\n\n_Veuillez supprimer tous les états du connecteur 0 once_",
        "it": "* abbiamo rimosso gli stati dal connettore principale che non sono ammessi lì\n* ora sincronizzamo la configurazione in adattatore\n* abbiamo aggiunto ack flag allo stato di disponibilità\n* abbiamo aggiunto ack flag per `charge limit` stati\n* abbiamo ottimizzato la registrazione degli errori\n* ora permettiamo la modifica della configurazione del caricabatterie tramite adattatore\n* abbiamo migliorato la gestione delle connessioni\n\n_ Si prega di eliminare tutti gli stati del connettore 0 una volta_",
        "es": "* eliminamos estados del conector principal que no están permitidos allí\n* ahora sincronizamos la configuración en adaptador\n* añadimos bandera a la disponibilidad del estado\n* añadimos bandera para los estados del límite de carga\n* optimizamos el registro de errores\n* ahora permitimos cambiar la configuración del cargador a través del adaptador\n* mejoramos el manejo de reconexión\n\n_Por favor, elimine todos los estados del conector 0 una vez_",
        "pl": "* usunął stan z głównego złącza, które nie są dozwolone w tym miejscu\n* – obecnie synchronizujemy konfigurację do adaptatora\n* - dodano flagę dotyczącą dostępności państwa\ndodał także flagę dla państw ograniczoną do ładowania\n* zoptymalizowano błąd logowania\n* teraz umożliwiamy zmianę konfiguracji ładunku poprzez adapter\n* ulepszamy ponowne połączenia\n\n_Please usuwa wszystkie stany złącza 0",
        "uk": "* ми видалили штати з основного роз'єму, які не допускаються там\n* ми тепер синхронізуємо конфігурацію в адаптер\n* ми додали стійку прапору до стану доступності\n* ми додали прапорець ack для станів `зарядного ліміту`\n* ми оптимізуємо запис помилок\n* тепер ми можемо змінити налаштування зарядного пристрою через адаптер\n* ми вдосконалили роботу з відключенням\n\n_Видалити всі стани роз'єму 0 раз_",
        "zh-cn": "* 我们从没有允许的主要联系国中除名。\n* 我们现在将组合与适应人员同步进行\n* 我们增添了有国旗的旗帜。\n* 我们增加了“附加限额”的旗帜。\n* 我们优化了错误伐木\n* 我们现在能够通过适应办法改变费用配置\n* 我们改善了重新安排工作\n\n—— 删除所有连接国0国。"
      }
    },
    "title": "Open Charge Point Protocol",
    "titleLang": {
      "en": "Open Charge Point Protocol",
      "de": "Offenes Ladepunktprotokoll",
      "ru": "Протокол открытой точки зарядки",
      "pt": "Protocolo de ponto de carga aberto",
      "nl": "Open Laadpunt Protocol",
      "fr": "Protocole de point de charge ouvert",
      "it": "Protocollo punto di ricarica aperto",
      "es": "Protocolo de punto de carga abierto",
      "pl": "Otwórz protokół punktu ładowania",
      "zh-cn": "开放充电点协议"
    },
    "desc": {
      "en": "Adapter for OCPP 1.6",
      "de": "Adapter für OCPP 1.6",
      "ru": "Адаптер для OCPP 1.6",
      "pt": "Adaptador para OCPP 1.6",
      "nl": "Adapter voor OCPP 1.6",
      "fr": "Adaptateur pour OCPP 1.6",
      "it": "Adattatore per OCPP 1.6",
      "es": "Adaptador para OCPP 1.6",
      "pl": "Adapter do OCPP 1.6",
      "zh-cn": "OCPP 1.6 适配器"
    },
    "authors": [
      "foxriver76 <moritz.heusinger@gmail.com>"
    ],
    "keywords": [
      "wallbox",
      "ocpp",
      "energy"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "ocpp.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/foxriver76/ioBroker.ocpp/main/admin/ocpp.png",
    "readme": "https://github.com/foxriver76/ioBroker.ocpp/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "compact": true,
    "adminUI": {
      "config": "json"
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<=0.7.0",
            "newVersion>0.7.0"
          ]
        },
        "level": "info",
        "title": {
          "en": "Structure has changed!",
          "de": "Struktur hat sich verändert!",
          "ru": "Структура изменилась!",
          "pt": "A estrutura mudou!",
          "nl": "Structuur is veranderd!",
          "fr": "La structure a changé !",
          "it": "La struttura è cambiata!",
          "es": "¡La estructura ha cambiado!",
          "pl": "Struktura zmieniła się!",
          "zh-cn": "结构已经改变!"
        },
        "text": {
          "en": "The structure of the datapoints has changed to support wallboxes with multiple connectors. Please delete states once and adjust your scripts!",
          "de": "Die Struktur der Datenpunkte hat sich geändert, um Wandboxen mit mehreren Steckverbindern zu unterstützen. Bitte löschen Sie die Zustände einmal und justieren Sie Ihre Skripte!",
          "ru": "Структура точек данных изменилась для поддержки настенных коробок с несколькими разъемами. Пожалуйста, удалите штаты один раз и настройте свои скрипты!",
          "pt": "A estrutura dos datapoints mudou para suportar caixas de parede com vários conectores. Por favor, exclua estados uma vez e ajuste seus scripts!",
          "nl": "De structuur van de datapoints is veranderd om muren te ondersteunen met meerdere connectoren. Verwijder de staten eens en pas je scripts aan!",
          "fr": "La structure des points de données a changé pour soutenir les boîtes murales avec plusieurs connecteurs. Veuillez supprimer les états une fois et ajuster vos scripts!",
          "it": "La struttura dei datapoint è cambiata per supportare le wallbox con connettori multipli. Si prega di eliminare gli stati una volta e regolare gli script!",
          "es": "La estructura de los puntos de datos ha cambiado para soportar cajas de pared con múltiples conectores. Por favor, eliminar estados una vez y ajustar sus scripts!",
          "pl": "Struktura punktów danych została zmieniona na obsługę skrzydeł z wieloma złączami. Okazuje się, że po raz pierwszy usuną i poprawiają swoje scenariusze!",
          "zh-cn": "数据点的结构已改变,以支助有多种连接器的隔离墙。 请注意并调整你的文字!"
        },
        "buttons": [
          "ok"
        ]
      }
    ],
    "connectionType": "local",
    "dataSource": "push",
    "materialize": true,
    "dependencies": [
      {
        "js-controller": ">=3.3.15"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.0"
      }
    ]
  },
  "native": {
    "port": 9220,
    "authentication": false,
    "username": "",
    "password": ""
  },
  "protectedNative": [
    "username",
    "password"
  ],
  "encryptedNative": [
    "username",
    "password"
  ],
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "List of connected devices",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    }
  ]
}
