{
  "common": {
    "name": "ocpp",
    "version": "0.12.4",
    "news": {
      "0.12.4": {
        "en": "only send number phases if it is of type number",
        "de": "nur nummernphasen senden, wenn es sich um typnummer handelt",
        "ru": "только отправить число фаз, если это номер типа",
        "pt": "só enviar fases de número se for de número de tipo",
        "nl": "stuur alleen nummerfases als het een soort nummer is",
        "fr": "seulement envoyer des phases de nombre si elle est de type numéro",
        "it": "solo inviare fasi di numero se è di numero di tipo",
        "es": "sólo enviar fases de número si es de tipo número",
        "pl": "wysyłana jest tylko liczba typów",
        "uk": "тільки надсилайте ряд фази, якщо це число типу",
        "zh-cn": "只派遣若干阶段,只有种类数量"
      },
      "0.12.3": {
        "en": "allow deactivating `numberPhases` by setting `null",
        "de": "deaktivieren der Anzahl Phasen durch Einstellung `null",
        "ru": "позволяют деактивировать номер Фазы по настройке `null",
        "pt": "permitir o número de desativação Fases por definição `null",
        "nl": "_ Fases door te zetten",
        "fr": "permettre de désactiver le nombre Phases en définissant `null",
        "it": "consentire di disattivare il numero Fasi per impostazione `null",
        "es": "permite desactivar el número Phases by setting `null",
        "pl": "pozwala dezaktywować liczbę Phases by setting the Null (ang.)",
        "uk": "дозволяє деактивувати номер Фази за допомогою налаштування `null",
        "zh-cn": "允许人数减少 D. 确定“绝对”的阶段"
      },
      "0.12.2": {
        "en": "ensure main connector is always created even if no status received there",
        "de": "sicherzustellen, dass der hauptverbinder immer erstellt wird, auch wenn dort kein status erhalten wird",
        "ru": "обеспечить главный соединитель всегда созданный даже если никакой статус не получил там",
        "pt": "assegurar o conector principal é sempre criado mesmo que nenhum status recebido lá",
        "nl": "zorg ervoor dat de belangrijkste connector altijd gecreëerd wordt, zelfs als er geen status is ontvangen",
        "fr": "assurer le connecteur principal est toujours créé même si aucun statut n'y a été reçu",
        "it": "garantire il connettore principale è sempre creato anche se non lo stato ricevuto lì",
        "es": "garantizar el conector principal siempre se crea incluso si no se recibe ningún estado allí",
        "pl": "zastrzeżenia głównego połączenia są zawsze tworzone, nawet jeśli nie otrzyma się żadnej ustawy",
        "uk": "забезпечення основного роз'єму завжди створюється навіть якщо його немає",
        "zh-cn": "为了确保主要联系者,即使没有获得任何身份,也总是建立起来。"
      },
      "0.12.1": {
        "en": "we now also detect feature profiles if clients add unallowed whitespaces",
        "de": "wir erkennen nun auch feature-profile, wenn clients unallowed whitespaces hinzufügen",
        "ru": "мы теперь также обнаруживаем профили функции, если клиенты добавляют неразрешенные белые пространства",
        "pt": "agora também detectamos perfis de recursos se os clientes adicionarem espaços brancos não permitidos",
        "nl": "we detecteren nu ook kenmerken als cliënten onopgeloste witspaces toevoegen",
        "fr": "nous détectons maintenant des profils de fonctionnalités si les clients ajoutent des espaces blancs non autorisés",
        "it": "ora anche rilevare profili di funzionalità se i client aggiungono spazi bianchi non consentiti",
        "es": "ahora también detectamos perfiles de características si los clientes añaden espacios blancos no permitidos",
        "pl": "obecnie wykrywamy również profile, jeśli klienci dodają nieprzyzwyczajne białej przestrzeni",
        "uk": "ми тепер також визначаємо профілі функцій, якщо клієнти додають неперевершені білі простори",
        "zh-cn": "现在,如果客户增加白空间,我们也发现各种特点。"
      },
      "0.12.0": {
        "en": "the `idTag` for remote transactions is now `ioBroker` persistent over all transactions\nimplemented the management of authentication list\nonly create states if supported by profile (closes #22)\nincreased stability on first connection",
        "de": "der idTag für Remote-Transaktionen ist jetzt ioBroker persistent über alle Transaktionen\ndie verwaltung der authentifizierungsliste implementiert\nnur zustände erstellen, wenn von profil unterstützt (schließt #22)\nerhöhte stabilität beim ersten anschluss",
        "ru": "idTag для удаленных транзакций теперь ioBroker настойчиво по всем операциям\nреализовано управление списком аутентификации\nтолько создавать государства, если поддерживается профилем (closes #22)\nповышенная стабильность при первом подключении",
        "pt": "o idTag para transações remotas é agora ioBroker persistente sobre todas as transações\nimplementou a gestão da lista de autenticação\nsomente criar estados se suportado pelo perfil (fecha #22)\naumento da estabilidade na primeira conexão",
        "nl": "de idTag voor afgelegen transacties is nu ioBroker volhardend over alle transacties\nde management van de authenticatielijst\ncreëer alleen staten als ondersteund door profiel (closes #22)\nverhoogde stabiliteit op het eerste verband",
        "fr": "idTag pour les transactions à distance est maintenant ioBroker persistant sur toutes les transactions\nmis en œuvre la gestion de la liste d'authentification\ncréer des états uniquement si le profil est supporté (ferme #22)\nune stabilité accrue à la première connexion",
        "it": "il idTag per le transazioni remote è ora ioBroker persistente su tutte le transazioni\nimplementato la gestione dell'elenco di autenticazione\nsolo creare stati se supportati dal profilo (chiude #22)\nmaggiore stabilità sul primo collegamento",
        "es": "idTag para transacciones remotas es ahora ioBroker persistente sobre todas las transacciones\nimplementó la gestión de la lista de autenticación\nsólo crear estados si apoyados por perfil (cerca #22)\nmayor estabilidad en la primera conexión",
        "pl": "idTag dla odległych transakcji jest obecnie ioBrokerem uproszczonym nad wszystkimi transakcjami\nzaimplementował zarządzanie listami autentyczności\nutwory mogą być wspierane przez profil (ogranicz #22)\nzwiększona stabilność pierwszego związku",
        "uk": "idTag для віддалених транзакцій тепер ioBroker стійкий до всіх транзакцій\nвпроваджено управління переліком автентифікації\nтільки створити стани, якщо підтримується профіль (закриває #22)\nпідвищена стійкість при першому підключенні",
        "zh-cn": "远距离交易的投标现在是对所有交易都保持沉默。\n执行核证清单的管理\n只有在概况(编号:第22号)支持下才能创建国家\nb. 第一个联系方面的稳定增加"
      },
      "0.11.1": {
        "en": "we now correctly detect data type and role of configuration attributes",
        "de": "wir erkennen nun den datentyp und die rolle von konfigurationsattributen korrekt",
        "ru": "мы теперь правильно обнаруживаем тип данных и роль атрибутов конфигурации",
        "pt": "agora detectamos corretamente o tipo de dados e o papel dos atributos de configuração",
        "nl": "we detecteren datatype en rol van configuatie-aanklachten",
        "fr": "nous détectons maintenant correctement le type de données et le rôle des attributs de configuration",
        "it": "ora rilevare correttamente il tipo di dati e il ruolo degli attributi di configurazione",
        "es": "detectamos correctamente el tipo de datos y el papel de los atributos de configuración",
        "pl": "obecnie wykrywamy typ danych i rolę atrybutów konfiguracyjnych",
        "uk": "ми тепер правильно виявити тип даних і роль атрибутів конфігурації",
        "zh-cn": "我们现在正确地发现数据类型和组合特征的作用"
      },
      "0.11.0": {
        "en": "`idTag` is now read correctly from `startTransaction` message (closes #21)\nimplemented possibility to trigger `hard` and `soft` reset",
        "de": "idTag wird nun korrekt von startTransaction message gelesen (schließt #21)\nimplementierte möglichkeit, harte und weiche rückstellung auszulösen",
        "ru": "idTag теперь правильно читается с сообщения startTransaction (closes #21)\nреализована возможность вызвать жесткий и мягкий сброс",
        "pt": "idTag é agora lido corretamente da mensagem startTransaction (closes #21)\npossibilidade implementada para desencadear hard e soft reset",
        "nl": "IDTag wordt nu juist gelezen van start-Transactie bericht (closes #21)\nde mogelijkheid om hard en zacht reset te activeren",
        "fr": "idTag est maintenant lu correctement à partir du message de lancementTransaction (ferme #21)\npossibilité de déclencher une réinitialisation dure et douce",
        "it": "idTag è ora letto correttamente dal messaggio startTransaction (chiude #21)\npossibilità implementata per attivare reset rigido e morbido",
        "es": "idTag ahora se lee correctamente desde el mensaje de inicioTransacción (cerca #21)\nposibilidad implementada para desencadenar el reinicio duro y suave",
        "pl": "idTag jest teraz odczytywany z wiadomości startTransaction (o blisko 21)\nzaimplementowana możliwość wywołania twardego i łagodnego resetu",
        "uk": "idTag тепер добре читається від початкуПереказ повідомлення (закриває #21)\nвпроваджено можливість викликати жорсткий і м'який скидання",
        "zh-cn": "现已正确地阅读了自开始的流通信息(第21号行动)\nb. 实施的可能性"
      }
    },
    "title": "Open Charge Point Protocol",
    "titleLang": {
      "en": "Open Charge Point Protocol",
      "de": "Offenes Ladepunktprotokoll",
      "ru": "Протокол открытой точки зарядки",
      "pt": "Protocolo de ponto de carga aberto",
      "nl": "Open Laadpunt Protocol",
      "fr": "Protocole de point de charge ouvert",
      "it": "Protocollo punto di ricarica aperto",
      "es": "Protocolo de punto de carga abierto",
      "pl": "Otwórz protokół punktu ładowania",
      "zh-cn": "开放充电点协议"
    },
    "desc": {
      "en": "Adapter for OCPP 1.6",
      "de": "Adapter für OCPP 1.6",
      "ru": "Адаптер для OCPP 1.6",
      "pt": "Adaptador para OCPP 1.6",
      "nl": "Adapter voor OCPP 1.6",
      "fr": "Adaptateur pour OCPP 1.6",
      "it": "Adattatore per OCPP 1.6",
      "es": "Adaptador para OCPP 1.6",
      "pl": "Adapter do OCPP 1.6",
      "zh-cn": "OCPP 1.6 适配器"
    },
    "authors": [
      "foxriver76 <moritz.heusinger@gmail.com>"
    ],
    "keywords": [
      "wallbox",
      "ocpp",
      "energy"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "ocpp.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/foxriver76/ioBroker.ocpp/main/admin/ocpp.png",
    "readme": "https://github.com/foxriver76/ioBroker.ocpp/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "energy",
    "compact": true,
    "adminUI": {
      "config": "json"
    },
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<=0.7.0",
            "newVersion>0.7.0"
          ]
        },
        "level": "info",
        "title": {
          "en": "Structure has changed!",
          "de": "Struktur hat sich verändert!",
          "ru": "Структура изменилась!",
          "pt": "A estrutura mudou!",
          "nl": "Structuur is veranderd!",
          "fr": "La structure a changé !",
          "it": "La struttura è cambiata!",
          "es": "¡La estructura ha cambiado!",
          "pl": "Struktura zmieniła się!",
          "zh-cn": "结构已经改变!"
        },
        "text": {
          "en": "The structure of the datapoints has changed to support wallboxes with multiple connectors. Please delete states once and adjust your scripts!",
          "de": "Die Struktur der Datenpunkte hat sich geändert, um Wandboxen mit mehreren Steckverbindern zu unterstützen. Bitte löschen Sie die Zustände einmal und justieren Sie Ihre Skripte!",
          "ru": "Структура точек данных изменилась для поддержки настенных коробок с несколькими разъемами. Пожалуйста, удалите штаты один раз и настройте свои скрипты!",
          "pt": "A estrutura dos datapoints mudou para suportar caixas de parede com vários conectores. Por favor, exclua estados uma vez e ajuste seus scripts!",
          "nl": "De structuur van de datapoints is veranderd om muren te ondersteunen met meerdere connectoren. Verwijder de staten eens en pas je scripts aan!",
          "fr": "La structure des points de données a changé pour soutenir les boîtes murales avec plusieurs connecteurs. Veuillez supprimer les états une fois et ajuster vos scripts!",
          "it": "La struttura dei datapoint è cambiata per supportare le wallbox con connettori multipli. Si prega di eliminare gli stati una volta e regolare gli script!",
          "es": "La estructura de los puntos de datos ha cambiado para soportar cajas de pared con múltiples conectores. Por favor, eliminar estados una vez y ajustar sus scripts!",
          "pl": "Struktura punktów danych została zmieniona na obsługę skrzydeł z wieloma złączami. Okazuje się, że po raz pierwszy usuną i poprawiają swoje scenariusze!",
          "zh-cn": "数据点的结构已改变,以支助有多种连接器的隔离墙。 请注意并调整你的文字!"
        },
        "buttons": [
          "ok"
        ]
      }
    ],
    "connectionType": "local",
    "dataSource": "push",
    "materialize": true,
    "dependencies": [
      {
        "js-controller": ">=3.3.15"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.0"
      }
    ]
  },
  "native": {
    "port": 9220,
    "authentication": false,
    "username": "",
    "password": ""
  },
  "protectedNative": [
    "username",
    "password"
  ],
  "encryptedNative": [
    "username",
    "password"
  ],
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "List of connected devices",
        "type": "string",
        "read": true,
        "write": false,
        "def": ""
      },
      "native": {}
    }
  ]
}
